import React from 'react';

import chatData from 'src/utils/chatData';
import ChatDropdownHeader from 'src/components/Chat/ChatDropdownHeader';
import styles from './ChatDropdown.module.scss';

const ChatDropdown = () => {
  return (
    <aside className={styles.container}>
      <ChatDropdownHeader />
      {chatData.map((card) => (
        <div key={card.id} className={styles.card}>
          {!card.likes ? (
            <div className={styles.cardLikes}>
              <LikeIcon />
            </div>
          ) : (
            <div className={styles.cardLikes}>
              <LikeIcon fill="#FF5757" />
              <span>21</span>
            </div>
          )}
          <div className={styles.cardImage}>
            <card.userImage />
          </div>
          <div className={styles.cardText}>
            <p>
              {card.username}
              {` `}
              {card.tag && (
                <span
                  className={styles.cardTextTag}
                  style={{
                    backgroundColor: card.tagColor,
                    color: card.tagTextColor,
                  }}
                >
                  {card.tag}
                </span>
              )}
              {` `}
              <span>8:05</span>
            </p>
            <p>
              {card.replyTo && (
                <span className={styles.cardTextReply}>
                  <UserIcon /> {`${card.replyTo}: `}
                </span>
              )}
              {card.message}
            </p>
          </div>
        </div>
      ))}
      <div className={styles.inputContainer}>
        <textarea placeholder="Введите текст сообщения..." />
        <div className={styles.inputContainerButtons}>
          <div className={styles.inputContainerButtonsButton}>
            <SmileIcon />
          </div>
          <div className={styles.inputContainerButtonsButton}>
            <SendIcon />
          </div>
        </div>
      </div>
    </aside>
  );
};

const LikeIcon = ({ fill }: { fill?: string }) => (
  <svg
    width="13"
    height="14"
    viewBox="0 0 13 14"
    xmlns="http://www.w3.org/2000/svg"
  >
    <g clipPath="url(#clip0_535_11110)">
      <path
        d="M12.9784 4.06222C12.7887 1.9736 11.3103 0.458258 9.46024 0.458258C8.22767 0.458258 7.0991 1.12155 6.46406 2.18461C5.83478 1.1078 4.75247 0.458008 3.53965 0.458008C1.68979 0.458008 0.211203 1.97334 0.0216921 4.06197C0.00669121 4.15422 -0.0548123 4.63975 0.132198 5.43154C0.401714 6.57361 1.02425 7.61242 1.93205 8.43497L6.46106 12.545L11.0678 8.43522C11.9756 7.61242 12.5982 6.57386 12.8677 5.43154C13.0547 4.64 12.9932 4.15447 12.9784 4.06222Z"
        fill={fill || `white`}
        fillOpacity={fill ? `none` : `0.2`}
      />
    </g>
    <defs>
      <clipPath id="clip0_535_11110">
        <rect
          width="13"
          height="13"
          fill="white"
          transform="translate(0 0.00146484)"
        />
      </clipPath>
    </defs>
  </svg>
);

const UserIcon = () => (
  <svg
    width="11"
    height="10"
    viewBox="0 0 11 10"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <g clipPath="url(#clip0_534_21111)">
      <path
        d="M9.37783 8.86674C9.07904 7.05771 8.29969 5.27501 6.46099 4.70335C7.17557 4.3028 7.64987 3.5901 7.64987 2.77585C7.64987 1.52345 6.52158 0.506104 5.12793 0.506104C3.73429 0.506104 2.606 1.52157 2.606 2.77585C2.606 3.58822 3.08239 4.3028 3.79488 4.70335C1.95618 5.27501 1.17474 7.05771 0.878039 8.86674C0.821625 9.20335 1.11623 9.5061 1.49442 9.5061H8.75727C9.13964 9.5061 9.43424 9.20335 9.37783 8.86674ZM3.55669 2.77585C3.55669 1.99545 4.26291 1.35984 5.13002 1.35984C5.33688 1.35984 5.50612 1.51216 5.50612 1.69833C5.50612 1.8845 5.33688 2.03682 5.13002 2.03682C4.67662 2.03682 4.30888 2.36778 4.30888 2.77585C4.30888 2.96202 4.13964 3.11434 3.93278 3.11434C3.72384 3.11434 3.55669 2.9639 3.55669 2.77585Z"
        fill="#FCD535"
      />
    </g>
    <defs>
      <clipPath id="clip0_534_21111">
        <rect
          width="10"
          height="9"
          fill="white"
          transform="translate(0.128906 0.506104)"
        />
      </clipPath>
    </defs>
  </svg>
);

const SmileIcon = () => (
  <svg
    width="13"
    height="14"
    viewBox="0 0 13 14"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <g clipPath="url(#clip0_534_21094)">
      <path
        d="M6.5 0.5C2.9159 0.5 0 3.4159 0 7C0 10.5841 2.9159 13.5 6.5 13.5C10.0841 13.5 13 10.5841 13 7C13 3.4159 10.0841 0.5 6.5 0.5ZM6.5 12.3182C3.56752 12.3182 1.18182 9.93245 1.18182 7C1.18182 4.06755 3.56752 1.68182 6.5 1.68182C9.43248 1.68182 11.8182 4.06755 11.8182 7C11.8182 9.93245 9.43245 12.3182 6.5 12.3182Z"
        fill="white"
      />
      <path
        d="M8.50641 8.41472H4.4952C4.2562 8.41472 4.04071 8.55866 3.94928 8.77951C3.85784 9.00031 3.90839 9.25448 4.07739 9.42348C4.72471 10.0708 5.58539 10.4273 6.50082 10.4273C7.41626 10.4273 8.27694 10.0708 8.92426 9.42348C9.09326 9.25448 9.1438 9.00035 9.05237 8.77951C8.9609 8.55866 8.74541 8.41472 8.50641 8.41472Z"
        fill="white"
      />
      <path
        d="M4.53632 6.29642C4.68286 6.14987 4.76716 5.9466 4.76716 5.73939C4.76716 5.53217 4.68286 5.3289 4.53632 5.18232C4.38977 5.03581 4.1865 4.95151 3.97929 4.95151C3.77168 4.95151 3.5688 5.03581 3.42225 5.18232C3.27532 5.3289 3.19141 5.53217 3.19141 5.73939C3.19141 5.9466 3.27532 6.14987 3.42225 6.29642C3.5688 6.44296 3.77207 6.52727 3.97929 6.52727C4.1865 6.52727 4.38977 6.44292 4.53632 6.29642Z"
        fill="white"
      />
      <path
        d="M9.0203 4.95151C8.81309 4.95151 8.60982 5.03581 8.46327 5.18232C8.31672 5.3289 8.23242 5.53174 8.23242 5.73939C8.23242 5.9466 8.31672 6.14987 8.46327 6.29642C8.60982 6.44296 8.81309 6.52727 9.0203 6.52727C9.22751 6.52727 9.43079 6.44292 9.57733 6.29642C9.72427 6.14987 9.80818 5.9466 9.80818 5.73939C9.80818 5.53217 9.72427 5.3289 9.57733 5.18232C9.43079 5.03581 9.22791 4.95151 9.0203 4.95151Z"
        fill="white"
      />
    </g>
    <defs>
      <clipPath id="clip0_534_21094">
        <rect
          width="13"
          height="13"
          fill="white"
          transform="translate(0 0.5)"
        />
      </clipPath>
    </defs>
  </svg>
);

const SendIcon = () => (
  <svg
    width="13"
    height="14"
    viewBox="0 0 13 14"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <g clipPath="url(#clip0_534_21090)">
      <path
        d="M12.8063 0.64875C12.8046 0.64766 12.8041 0.646037 12.803 0.644972C12.7998 0.642258 12.7965 0.641726 12.7933 0.639013C12.7646 0.614137 12.7305 0.597907 12.697 0.580056C12.6862 0.574654 12.678 0.565449 12.6667 0.560581C12.6651 0.560048 12.664 0.560048 12.6629 0.55949C12.651 0.554622 12.6413 0.545975 12.6294 0.541638C12.5845 0.524877 12.5369 0.51945 12.4887 0.51514C12.4741 0.514049 12.46 0.507558 12.4454 0.507558C12.3827 0.507025 12.3194 0.517295 12.2577 0.539483L0.35642 4.8672C0.167631 4.9359 0.0323719 5.10361 0.00478257 5.30267C-0.0217164 5.50176 0.063207 5.69919 0.22712 5.81604L3.82509 8.38619L4.33306 11.9441C4.36443 12.1605 4.52294 12.3369 4.73501 12.3915C4.77936 12.4029 4.8248 12.4083 4.86918 12.4083C5.03634 12.4083 5.19809 12.3304 5.3014 12.1919L6.57809 10.4906L9.92614 13.362C10.0262 13.4475 10.1512 13.4924 10.2788 13.4924C10.3394 13.4924 10.4 13.4821 10.4595 13.4615C10.6413 13.3966 10.776 13.2392 10.8106 13.0488L12.9912 1.15778C13.027 0.963035 12.9512 0.771533 12.8063 0.64875ZM6.08907 9.33452L6.05012 9.39079L5.21972 10.4981L4.90541 8.29639L9.59938 4.22778L6.08907 9.33452Z"
        fill="#1D1E26"
      />
    </g>
    <defs>
      <clipPath id="clip0_534_21090">
        <rect
          width="13"
          height="13"
          fill="white"
          transform="translate(0 0.5)"
        />
      </clipPath>
    </defs>
  </svg>
);

export default ChatDropdown;
